In [27]:
import pandas as pd
import numpy as np

In [44]:
df = pd.read_csv('score_level.csv')

In [45]:
df.head()

     name  score Grade    Comment
0   Rahim     80    A+  Excellent
1   Karim     89    A+  Excellent
2  Jabbar     75     A  Very Good
3    Amin     73     A  Very Good
4   Hafiz     40     D     Averge

In [46]:
df

     name  score Grade    Comment
0   Rahim     80    A+  Excellent
1   Karim     89    A+  Excellent
2  Jabbar     75     A  Very Good
3    Amin     73     A  Very Good
4   Hafiz     40     D     Averge
5   Nafiz     65     C       Good
6   Nahid     66     C       Good
7   Sohan     55     D    Average
8   Fahim     30     F        Bad

In [47]:
df.isnull().sum()

name       0
score      0
Grade      0
Comment    0
dtype: int64

In [48]:
df.Comment.unique()

array(['Excellent', 'Very Good', 'Averge', 'Good', 'Average', 'Bad'],
      dtype=object)

# Label Encoding

In [49]:
from sklearn.preprocessing import LabelEncoder

In [50]:
df.head()

     name  score Grade    Comment
0   Rahim     80    A+  Excellent
1   Karim     89    A+  Excellent
2  Jabbar     75     A  Very Good
3    Amin     73     A  Very Good
4   Hafiz     40     D     Averge

In [51]:
label=LabelEncoder()

In [52]:
df.Comment=label.fit_transform(df['Comment'])

In [53]:
df.Comment.head()

0    3
1    3
2    5
3    5
4    1
Name: Comment, dtype: int32

In [54]:
df.Comment

0    3
1    3
2    5
3    5
4    1
5    4
6    4
7    0
8    2
Name: Comment, dtype: int32

In [55]:
df

     name  score Grade  Comment
0   Rahim     80    A+        3
1   Karim     89    A+        3
2  Jabbar     75     A        5
3    Amin     73     A        5
4   Hafiz     40     D        1
5   Nafiz     65     C        4
6   Nahid     66     C        4
7   Sohan     55     D        0
8   Fahim     30     F        2

# One-Hot Encoding

In [3]:
df = pd.read_csv('score_level.csv')

In [4]:
df.head()

     name  score Grade    Comment
0   Rahim     80    A+  Excellent
1   Karim     89    A+  Excellent
2  Jabbar     75     A  Very Good
3    Amin     73     A  Very Good
4   Hafiz     40     D     Averge

In [9]:
dummy_vars=pd.get_dummies(df['Comment'])

In [10]:
new_df = df.drop('Comment', axis=1)

In [11]:
new_df.head()

     name  score Grade
0   Rahim     80    A+
1   Karim     89    A+
2  Jabbar     75     A
3    Amin     73     A
4   Hafiz     40     D

In [13]:
df1=pd.concat([new_df,dummy_vars],axis=1)

In [14]:
df1.head()

     name  score Grade  Average  Averge  Bad  Excellent  Good  Very Good
0   Rahim     80    A+        0       0    0          1     0          0
1   Karim     89    A+        0       0    0          1     0          0
2  Jabbar     75     A        0       0    0          0     0          1
3    Amin     73     A        0       0    0          0     0          1
4   Hafiz     40     D        0       1    0          0     0          0

# Ordinal Encoding

In [2]:
df = pd.read_csv('score_level.csv')

In [3]:
df.head()

     name  score Grade    Comment
0   Rahim     80    A+  Excellent
1   Karim     89    A+  Excellent
2  Jabbar     75     A  Very Good
3    Amin     73     A  Very Good
4   Hafiz     40     D     Averge

In [4]:
from sklearn.preprocessing import OrdinalEncoder

In [5]:
df.Comment.unique()

array(['Excellent', 'Very Good', 'Averge', 'Good', 'Average', 'Bad'],
      dtype=object)

In [11]:
cmnt_list =['Excellent', 'Very Good', 'Averge', 'Good', 'Average', 'Bad']

In [14]:
Ordn_enc = OrdinalEncoder(categories=[cmnt_list])

In [15]:
encoded_val = Ordn_enc.fit_transform(df[['Comment']])

In [16]:
new_Cmnts_order=pd.DataFrame(encoded_val, columns=['Comments'])

In [17]:
new_Cmnts_order

   Comments
0       3.0
1       3.0
2       5.0
3       5.0
4       1.0
5       4.0
6       4.0
7       0.0
8       2.0

In [18]:
df.head()

     name  score Grade    Comment
0   Rahim     80    A+  Excellent
1   Karim     89    A+  Excellent
2  Jabbar     75     A  Very Good
3    Amin     73     A  Very Good
4   Hafiz     40     D     Averge

In [19]:
df.Comment=new_Cmnts_order

In [20]:
df.head()

     name  score Grade  Comment
0   Rahim     80    A+      3.0
1   Karim     89    A+      3.0
2  Jabbar     75     A      5.0
3    Amin     73     A      5.0
4   Hafiz     40     D      1.0

# Hashing Encoding

In [29]:
pip install category_encoders

Collecting category_encoders
  Downloading category_encoders-2.3.0-py2.py3-none-any.whl (82 kB)
Requirement already satisfied: numpy>=1.14.0 in d:\anaconda\lib\site-packages (from category_encoders) (1.20.3)
Requirement already satisfied: statsmodels>=0.9.0 in d:\anaconda\lib\site-packages (from category_encoders) (0.12.2)
Requirement already satisfied: scipy>=1.0.0 in d:\anaconda\lib\site-packages (from category_encoders) (1.7.1)
Requirement already satisfied: patsy>=0.5.1 in d:\anaconda\lib\site-packages (from category_encoders) (0.5.2)
Requirement already satisfied: pandas>=0.21.1 in d:\anaconda\lib\site-packages (from category_encoders) (1.3.4)
Requirement already satisfied: scikit-learn>=0.20.0 in d:\anaconda\lib\site-packages (from category_encoders) (0.24.2)
Requirement already satisfied: python-dateutil>=2.7.3 in d:\anaconda\lib\site-packages (from pandas>=0.21.1->category_encoders) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in d:\anaconda\lib\site-packages (from pandas>=0.21.1->category_encoders) (2021.3)
Requirement already satisfied: six in d:\anaconda\lib\site-packages (from patsy>=0.5.1->category_encoders) (1.16.0)
Requirement already satisfied: joblib>=0.11 in d:\anaconda\lib\site-packages (from scikit-learn>=0.20.0->category_encoders) (1.1.0)
Requirement already satisfied: threadpoolctl>=2.0.0 in d:\anaconda\lib\site-packages (from scikit-learn>=0.20.0->category_encoders) (2.2.0)
Installing collected packages: category-encoders
Successfully installed category-encoders-2.3.0
Note: you may need to restart the kernel to use updated packages.

In [30]:
import category_encoders as ce

In [33]:
encoders=ce.HashingEncoder(cols='Comment' , n_components=6)

In [34]:
encoders.fit_transform(df)

   col_0  col_1  col_2  col_3  col_4  col_5    name  score Grade
0      0      1      0      0      0      0   Rahim     80    A+
1      0      1      0      0      0      0   Karim     89    A+
2      0      0      0      0      0      1  Jabbar     75     A
3      0      0      0      0      0      1    Amin     73     A
4      0      0      0      0      1      0   Hafiz     40     D
5      0      0      0      0      1      0   Nafiz     65     C
6      0      0      0      0      1      0   Nahid     66     C
7      0      0      0      0      1      0   Sohan     55     D
8      1      0      0      0      0      0   Fahim     30     F